{
    "exercise notifications subject moderator clarified": [
        "When you are walking and then you stop walking, Fitbit should not wait 15 min to send a reminder to end the exercise. At the very least, it should go on pause. What could possibly be the reason to leave such a gap? LizzyFitbit: PLEASE DO NOT CHANGE MY TITLE! Your \"edits\" make my posts not come up in searches.",
        "The device should track oxygen saturation during exercise, both for auto-detected exercise and manually tracked exercise activities.   Moderator Edit: Clarified subject and updated label",
        "Is anyone looking into this problem of exercise days disappearing? https://community.fitbit.com/t5/iOS-App/My-first-day-of-exercise-keeps-disappearing-from-the-app-and... Moderator edit: Clarified subject",
        "The new Heart rate in exercise is very hard to see from a User Experience. The previous color scheme was easier to see. Can we have the option of using a different color, its hard to see with color blindness Moderator edit: Clarified subject and updated label",
        "I’ve just started using the stress management feature since it popped up; or at least, I’ve gone in and checked one of the boxes periodically. I feel like a scale with 7 options vs 5 might be easier to respond to. As in, I might not feel “stressed” at a given moment, but might still be somewhere south of truly “neutral”; neither answer is correct.",
        "GPS tracking since last update has seriously dropped in quality Roll back to previous version for tracking exercise Moderator Edit: Clarified subject",
        "The heart rate during exercise is lagging behind vthe reality extremely. I had a medical checkup with the heart rate going up to 190 and the sense recorded 166. It is often reported that the heart rate measurement is quite good over long times, but not for short times. Intervalls etc. are not accurately measureable.",
        "I wish fitbit counted exercise on a stationary bike. Heart rate should be enough to prove I was exercising. Why can't we choose method of execise? Moderator edit: Clarified subject",
        "Let us enter manual blood pressure readings, to help us track trends. And give the option to receive a notification when stress is high. Something like \"take a break, do a breathing exercise\".   Moderator Edit: Clarified subject",
        "When my mum passed away, your \"look alive\" alarm was a constant reminder and made me feel crap.",
        "On the Charge 6, and I think this was the same on the 5, you cannot enable \"Exercise Focus\" to turn off notifications during exercise unless you enable Do Not Disturb. The Exercise Focus setting should not require DND to be enabled, since it should be conditional on using the Exercise app on the device. Moderator edit: Clarified subject",
        "The \"Active Call\" notification is unnecessary as it is redundant since the user will already know they are on an active call.",
        "Hi Web API team I am developing a very simple IRN email alert system for my 83 year-old dad who suffers from Afib. Upon reading your docs, I discovered that only alerts which have been read/viewed in the Fitbit app are returned by the API. While I understand that the Fitbit app is meant to be the primary entry point for viewing these important notifications, my father often misses them as: The sheer number of notifications from various apps can overwhelm him, causing important Afib alerts to be missed/overlooked His reduced dexterity and vision, combined with working memory challenges, make it difficult for him to navigate and manage notifications on his smartphone The small text, icons, and complex navigation within the notification center can make it hard for him to notice and interact with critical alerts Meanwhile, he is very comfortable using Gmail, which he checks multiple times a day. So having an Afib alert delivered via e-mail could potentially be a lifesaver. In addition, this would allow me to keep tabs on his Afib notifications without having to worry about whether he has viewed the list of Afib notifications in the Fitbit app. Please would you consider changing this API restriction? It could quite literally save lives. Thanks, Ted Moderator Edit: Clarified subject and updated label",
        "Add an exercise mode for hockey or skating and make it so touch is disabled.   Moderator Edit: Clarified subject",
        "Please give us the option to slide on the screen for a desired 7, 30, or 365 day period. Summaries now start at the beginning of a specific week, month, or year. The user can choose a previous period but it always starts on Monday, the 1st, or on Jan.1 for week, month, or year.",
        "Allow for people to turn on a setting indicating that you’re fasting for religious purposes. This could include easier go to exercise, delaying snack water reminders until a time set by wearer, etc   Moderator Edit: Clarified subject and updated label",
        "Please add a swim stroke tracker so that folks who swim in open water or in an endless pool can utilize the the swim exercise function. This was an issue with the ionic and needs to be fixed in an exercise tracker that claims it track swimming.",
        "Please add two additional events for when blood glucose levels were tested - \"before exercise\" and \"after exercise\".   Moderator Edit: Clarified subject",
        "Hi, I got sometimes a stream of notifications which I don't mind. But is there any possibility to clear notifications area without deleting them one by one? Moderator edit: updated subject for clarity",
        "To me, the biggest difference between walking and hiking, is the weight I carry... On a walk, I usually don't take a lot with me. But on a hike I always carry a bigger backpack (sometimes camping equipment) or my Kid in a carrier.",
        "I would like to see the impact of number of steps, exercise (days,hr), cal burned (other factors that influence weight loss) graphed with weight loss. I’m thinking of a combo graph that shows your weight but also one of the other data points.",
        "The vibrations in the relax app are distracting. Can you please make it possible to turn off the vibrations and to manually enter mindfulness training Moderator edit: Clarified subject",
        "When the Sense is connected to the charger there is no indication on the charging status. A brief message appeared and disappears. Often the message warns of a slow charging status but once that disappears there is no way to know the rate of charging. Disconnecting and reconnecting the charger usually fixes the problem.",
        "Please expand ECG interpretations for heart rates below 50 bpm. Athletes can have much lower heart rates than the population average. I, as an amateur athlete, have resting heart rates between 35 and 45 bpm without being considered ill because of it. In my actual case, the interpretation would be \"sinus bradycardia\" and not \"inconclusive\".",
        "I‘d like to see a setting to change how hard you need to tap the screen to get the Charge 5 to turn on:turn off alarms, etc.   Moderator Edit: Clarified subject",
        "In the mindful feature, I would like to see anxiety listed. Stress and anxiety are not.the same, and those of us whom have anxiety have different symptoms than just stress. Also when I am expert anxiety my Fitbit is perceiving it as active heart zone, when I am sitting still trying to focus on my breathing to correct the anxiety.",
        "All of my previous Fitbits (Sense, Versa, Blaze) had the notifications swipe down from the top, but the Sense 2 has notifications swipe up from the bottom. Suggestion: Create an option to have notifications swipe down to view instead of swipe up. https://community.fitbit.com/t5/Sense-2/Option-to-have-notifications-swipe-from-the-top/m-p/5301232   Moderator Edit: Clarified subject",
        "We need a barre option for exercise   Moderator Edit: Clarified subject",
        "Add stationary bike as an exercise you can log   Moderator Edit: Clarified subject",
        "Previously I could manually enter calories, along with the time, and distance to an exercise I was adding. That option has been removed. Please bring it back so that there can be accuracy in workouts Moderator edit: Clarified subject for clarity.",
        "For a Fitbit Sense, in the \"Exercise\" section of the Fitbit app, when you tap on \"Categorize Exercise\" it brings you to a screen that says \"Choose an Exercise\" and you have the choice of \"Search for exercise type\" or a \"Recent\" list that has 5 different activities. Those activities should reflect the persons actual recent activities they engaged in   Moderator Edit: Clarified subject"
    ],
    "edit moderator subject clarified updated": [
        "Along with many, I am very annoyed (to the point that I will not replace my Fitbit when it breaks but will go elsewhere) by the removal of the browser view. The IOS app only shows a run duration to the nearest minute, whereas the browser view showed to the second. Have you no idea what the basic requirements of a fitness tracker are?   Moderator Edit: Clarified subject",
        "Please can we have the actual, numerical estimate of calories remaining back on the app please? I have been following a sedentary calorie deficit plan since mid August and have lost over half a stone. I was very dependent on this metric to plan my food. Now I'm too scared to have a yoghurt in-case it tips my little pointer into the pink zone! Moderator Edit: Clarified subject",
        "Restore the ability to install 3rd party apps on the Versa 4 as was possible in previous versions of the watch.   Moderator Edit: Clarified subject and label.",
        "I just got back from I run and I can’t see the break down in splits per KM or the location in which I ran, or the breakdown or heart rate throughout that run? I bought this watch to do exactly that as that was how it was advertised to me.   Moderator Edit: Clarified subject",
        "I just got my wife and I matching Charge 6 watches and while I'm overall pleased enough with the user experience so far, the clock face selection leaves a lot to be desired. The vast majority of the options are simply unusable. The remaining few acceptable ones still are not particularly endearing. Moderator Edit: Clarified subject",
        "With the app redesign it appears I can no longer track my weekly miles from the app. When I click through to the secondary screen, I can see my daily miles and my average daily miles even when I go over to week or month. Moderator Edit: Clarified subject",
        "The app needs to have an option of colour overlay or for the icons to have an alt text under it to explain what the visual means. It’s too monochrome for adhd hard to seperate each stat",
        "By adding a daily summary (same content as weekly but with day information) would help replace some of the functionality being lost with the removal of the dashboard. Removing the dashboard is a game changer for my 81 year old mom. Web version allowed me to monitor her resting heart rate daily.   Moderator Edit: Clarified subject and updated label",
        "I'm visually impaired, and in the updated app, having been stripped of all color and animation, I have a hard time seeing goals I've reached and/or surpassed Moderator Edit: Clarified subject",
        "In the previous app, it showed my average and max heart rate. The graphic was also goof and showed you the highs/lows. The new app is very grey and only shows average HR (not max). Against the graph it shows zero to 200 so the variation in HR is harder to see..tried to add pic of same run. Left=new. Right=old. Moderator edit: Clarified subject",
        "I once loved using the app to check out my work out summary. Then there was an update that changed the summary format. It was awful, so I normally check it out through the actual website. Now, with another update, I can't even do that. Its the main feature I use but can no longer do that. Moderator edit: Clarified subject and updated label",
        "Please add Calendar app to Sense 2! This was available on my Versa, which was less expensive and presently obsolete. Spotify would be helpful as well   Moderator Edit: Clarified subject and updated label",
        "The app should have a way to set Water drinking reminders   Moderator Edit: Clarified subject",
        "I just received my new Pixel watch and was disappointed to find out I could no longer use my Versa 3 watch as well. My Pixel watch has a battery life of 24 hours which is not sufficient to get me through a camping weekend. I thought I could switch between the 2. I would be willing to remove all apps from my Versa 3 to get that functionality.   Moderator Edit: Clarified subject and label",
        "On the parent app, the last weeks stats go away at the beginning of the new week.   Moderator Edit: Clarified subject and updated label",
        "Add WiFi option to Sense 2.   Moderator Edit: Clarified subject and updated label",
        "An app to manually measure SpO2 for 1-2 min (like ECG) or can monitor oxygen concentration continuously all day   Moderator Edit: Clarified subject",
        "When I try save an edit to either duration or distance of an exercise session in the Android app, the save button appears to work, the updated data briefly flashes on the session information screen, then reverts to the automatically recorded data.   Moderator Edit: Clarified subject",
        "Similar to the Get Moving feature, there needs to be one for water intake. Set a daily goal and frequency, but auto-log with check feature after consuming.   Moderator Edit: Clarified subject",
        "Please include the ability to show weather on existing faces, or create a face that includes the current weather. If necessary, this could be resolved through user created skins, if they become allowed.   Moderator Edit: Clarified subject",
        "Show weight lost on home screen of app, or the depressing amount still remaining to be lost. I want encouragement for what I’ve done, not overwhelming info about what’s left to do. Moderator edit: Clarified subject and updated label",
        "In the horrific new iOS app, which needs to be jettisoned ASAP, I have to go through a cumbersome, multi-step process to connect to the stats for my minor children. I have to go to the family button, and then add a device to even bring up the existing childrens’ accounts. And then I have to go up to the settings wheel to toggle back. Why??? Moderator Edit: Clarified subject and updated label",
        "Upgraded from Ionic to Versa 2. Very disappointed with Swim tracking. Versa 2 lost the ability to keep track of elapsed laps. I have to count manually and that defeats the purpose of a fitness tracker. I was told this is working as designed. I will be returning the Versa 2 to Fitbit until this functionality is added. Going back to Ionic. Need the ability to customize Swim stats by: - Completed Laps - Elapsed Time - Heart Rate   (vote here!)   Moderator edit: Removed personal information and clarified subject",
        ". Information displayed against a swim, used to include the swimming pool, length, the duration, the total distance, and the number of length you swam. But all of a sudden the number of length feature has disappeared from both new swims, and those recorded in the past. Moderator Edit: Clarified subject and updated label",
        "Currently you can link Fitbit to health connect but it will only write data to it: it won't read any data from other apps.",
        "How can I submit a suggestion for the app? I was also really confused that there is a whole series of cooking videos from EatWell and Ayesha Curry but no indication at all about where to find the recipes. Simply putting a note at the bottom of the promo tile would be helpful but just sharing videos without recipes is kinda lazy and disregards user   Moderator Edit: Clarified subject and updated label",
        "I was so disappointed when I did not find the Bitmoji clock face on my new Versa 4. Please develop.",
        "Make it possible to change the 4 apps that show when button is Double Pressed on Fitbit sense2 as we could on Sense. Moderator edit: Clarified subject and updated label",
        "The countdown timer on the Sense does not save once you exit the Timer app. For example, if I were to set a 30 second countdown timer, I want to come back to the Timer app later today or tomorrow and it would still be saved to 30 seconds. It does this on the Versa / Versa 2. It does not do this on the Sense. Moderator edit: Clarified subject",
        "I have my weekly active zone minutes set at 400. The app no longer tracks my weekly total and remaining minutes for the week. The updated app version is no longer informative and lacks clarity. Please restore the 'Weekly Active Zone Minutes' graph. Please and thank you. ( I attached an image from the old version of the app. )",
        "I think you should add exercises that can be done at home without weights, such as squats, pushups, leg lifts, planks, crunches, etc. Moderator Edit: Clarified subject",
        "stop counting up all of my steps every time I open the app. Just show me my step total.   Moderator Edit: Clarified subject and updated label",
        "Had a hysterectomy don't need menstrual. Already did on the app, but still shows on watch.   Moderator Edit: Clarified subject and updated label",
        "Fitbit is the market leading provider of fitness wearables for the average everyday user, followed closely by apple (but Apple are boring). So why is Google forcing us to use YouTube music. That is just based on greed, you wouldn't limit your pixel phones to YouTube only? Music is an important part of exercise for most people users.   Moderator Edit: Clarified subject and updated label",
        "The food database is out of date. Please create a way to update it. Scanned barcodes return incorrect information. Moderator edit: Clarified subject",
        "I’d really like to see a plain watch face with muted colors for the Charge 6. Maybe just white numbers and white for the tracking stats.   Moderator Edit: Clarified subject and updated label",
        "as a new versa 2 owner I am disappointed to see that the ability to transfer music from my computer to versa 2 has been removed. I am now forced to pay an additional subscription to an app that I have never used.   Moderator Edit: Clarified subject and updated label",
        "If you are colour blind for green it is impossible to know if you have completed your goal. The old app screen was user friendly, motivating and so much better. Moderator Edit: Clarified subject and updated label",
        "I would like to use my CGM data (that is already being shared with Fitbit through Health Connect) to gain insights into my BG readings in the Fitbit app.   Moderator Edit: Clarified subject and updated label",
        "Altimeter to the next charge version Moderator edit: Clarified subject and updated label",
        "To have a health condition symptoms logging section so members with rhumatiod arthritis or anyother health condition can monitor the symptoms within the app.   Moderator Edit: Clarified subject and updated label",
        "I would like to see my highest and lowest heart rate for the previous and current month. Moderator edit: Clarified subject and updated label",
        "Please give the option to remove \"View your daily readiness score on your tracker\" from the watch. If we are not a premium subscriber, we have no need for this spam on the watch. Moderator edit: Clarified subject and updated label",
        "The data shown is too limited and vague. Tapping on each dot should reveal the value of the each reading. One example is the SpO2 and the other is the heart rate. At the moment tapping on each dot does nothing you are left guessing what the accurate result was.",
        "Get rid of the recipe suggests in the calorie tracker. Moderator edit: Clarified subject",
        "The stair/flight count seems to be very inaccurate and inconsistent. So having it as one of the 4 goals for the day has been a little frustrating for my child. Either the tracking should be fixed or this type of challenge should be removed. Moderator edit: Clarified subject",
        "We need auto pause. I couldn't believe that cycling does not have that 'feature'. Moderator Edit: Clarified subject and updated label",
        "Body fat scales (and the Galaxy Watch 4) both use bioelectrical impedance analysis to estimate body fat. Is it possible to do this using existing sensors on the Fitbit Sense and/or Charge (the ones for stress or the ECG app)?   Moderator Edit: Clarified subject",
        "It is beyond frustrating that there isn't one clock face that's inclusive of fitbit's visually diverse glasses wearing client base. Please make just one clock face that shows one giant fonted statistic at a time without the time on it (heart only etc) allowing us to cycle though. 24 clock faces, and not one can be read by people who need readers?",
        "That's crazy that Fitbit app doesn't allow to see more detailed chart of the Heart Rate or at least to rotate it to view in landscape mode!   Moderator Edit: Clarified subject and updated label",
        "This week, I noticed that the days exercised block is gone on the weekly email summary. I also used to visit the web browser dashboard via the email but the link is no longer working.   Moderator Edit: Clarified subject and updated label",
        "Please allow us to stream music while playing a guided walk or run with a premium subscription. When I play audio coaching, it stops the workout if I try to pull up music or a podcast from an outside app. Moderator edit: Clarified subject and updated label",
        "i would like there to be a way to change the order or delete some apps from the Charge 5.   Moderator Edit: Clarified subject and updated label",
        "Link with the Freestyle Libre Ap   Moderator Edit: Clarified subject",
        "Jogging, chopping wood, shoveling snow, treading water.   Moderator Edit: Clarified subject and updated label",
        "In the \"Sense\" I can personalize the data I see while swimming including the distance covered and the number of lengths. This is absent in \"Sense 2\" rendering it useless. Please restore this function to the \"Top Line\" Fitbit device. Moderator edit: Clarified subject and updated label",
        "Calibrate the typical movements with calorie burning etc. Moderator Edit: Clarified subject",
        "I would like to see what my baseline temperature is.   Moderator Edit: Clarified subject and updated label",
        "Can you please make an official flashlight app for the Sense and Versa 4? The 3rd party ones I had on my Original Sense were terrible. Moderator edit: Clarified subject and updated label",
        "I see all other data can be written but weight is not. Please add. Thanks. Moderator edit: Clarified subject and updated label",
        "Currently, none of the Fitbit-made clock faces for Sense 2 have battery levels on them. Yes, I know I can swipe for that, but why? Several 3rd-party apps offer this feature, so people obviously want it. I'm tired of being surprised that my Fitbit has no power. Moderator Edit: Clarified subject",
        "I would like to get the notification for the upcoming start of my period 5 days prior as that is when the PMS starts and an ovulation notification too!   Moderator Edit: Clarified subject and updated label",
        "Please allow the fitbit ace app be downloaded intentionally so family member not living in the US could also talk with the child using the watch   Moderator Edit: Clarified subject and updated label",
        "1. In standby mode where 1-tap is valid for display, ignore any tap within N milliseconds of actuation by one tap. A proposed value for N might be 2X the 2-tap timeout. 2. In clock mode, disable 2-tap detection.   Moderator Edit: Clarified subject",
        "Please show laps (or options for other data) WHILE swimming on Charge 4. You capture the data anyway, why not show it to me when I need it?   Moderator Edit: Clarified subject",
        "Provide swim pace data per lap instead of calories.  Would be helpful to have these time splits. At the end of workout, show total calories as well as average pace.",
        "Versa 3 does not have the amazing Treasure Trek game, it needs it!   Moderator Edit: Clarified subject",
        "Please add “In Pain” to the list of selectable options when the Stress Management feature asks: “How are you feeling?” Moderator edit: Clarified subject and updated label",
        "Does anyone know if/when the nutritional tracking for the app is going to be expanded to include poly and mono unsaturated fats? Possibly also other vitamins and minerals? I'm tired of having to use third party apps. I should be able to track everything in just Fitbit especially since I currently have the premium subscription.",
        "is there any way to get my countdown timer to go longer? i used to have the inspire 2 which could do like an hour and a half and i’m disappointed that my inspire 3 can only set a timer for an hour 😞    Moderator Edit: Clarified subject and label.",
        "At least on Sense I was able to organize my apps so that the default apps were at the end. Now, they aren't and it is annoying to have to scroll past them. Please allow users to: * remove apps they aren't going to use * organize apps so that, if they can't remove them, at least the apps aren't annoying and making searching/scrolling inefficient   Moderator Edit: Clarified subject and updated label",
        "Add user input field and data point for readiness score on at 1-5 scale. 3 (usual soreness) does not impact score. 1-2 (not sore or less sore) positively impacts or increases score, while 4-5 (sore or extremely sore) would negatively impact or reduce the readiness score. This could be a similar feature to the stress level indicators.",
        "Please change the weather app on the Sense 2 form military time. It’ll be a lot easier for us Lehman people.   Moderator Edit: Clarified subject and updated label",
        "Can we have the Water Lock option added to the Versa 3. Moderator edit: Clarified subject",
        "Ability to view live heart rate zones on mobile app during workout.   Moderator Edit: Clarified subject and updated label",
        "Multiple customers have shared how their strap tabs broke in changing straps. This is a serious problem. Please consider fixing this with a stronger securing machanism   Moderator Edit: Clarified subject",
        "We purchased the FitBit Inspire 3 specifically because it says that it monitors HR for 24 hours a day. Our daughter has POTS and this information is invaluable in treating her condition. You cannot print it from anywhere. The data download is a useless CSV file that you cannot extrapolate anything from. This is just an antiquated setup.   Moderator Edit: Clarified subject",
        "Please add airplane mode to the Fitbit Sense. Moderator edit: Clarified subject",
        "The heart rate performs really badly when doing a HIIT or weight workout. It shows a maximum of 110 bpm for the whole 30 minute workout when in reality I have 160 wnd the pulse is always higher than 140. Use a machine learning model to improve the heart rate value derived from the sensor.",
        "Put a clock face on the inspire 3 that includes steps heart rate and time.   Moderator Edit: Clarified subject",
        "I have slightly imperfect vision. To tell the time accurately, I need an analog clock face with ALL the following: 1. Contrast (eg solid white hands on a black background) 2. Hour markings 3. Second hand 4. No clutter Older Fitbits had highly legible options, but Luxe doesn’t. Karman comes closest, but it’s badly cluttered and only semi-legible.",
        "Please add either widgets for every data type ( not just steps ), so people can select what they need to know. Or allow users to customize the app interface, drastically streamlining it so it can be opened to a dashboard of just the required data. The current UI is a hideous mix of text, weird icons, and pictures.   Moderator Edit: Clarified subject",
        "Bring back the mindfulness button for kids that use the Fitbit app. It helped a lot and it disappeared. Moderator edit: Clarified subject",
        "I can't see my Inspire HR display when the sun is out.     Moderator edit:  updated subject for clarity.",
        "We want the possibility to edit the distance for treadmill activities. Moderator edit: Clarified subject",
        "Water reminder should be set up in the same way as \"Reminders to move\" Moderator edit: Clarified subject and updated label",
        "From a health perspective, should all liquids be captured as, or least, partially, in the Water page? i.e. coffee (lots of water), diet (zero calorie) soda, skim milk, etc. Thanks for the consideration, Tommy   Moderator edit: Updated subject for clarity.",
        "You need to add back Challenges, Adventures, Friends and Community. Social Interactions and communications are the foundation of all of these apps. Moderator edit: Clarified subject and updated label",
        "Use an icon, such as a red cross, to allow users to post a help request from the app. The user could allow the app to take & share a screenshot from their mobile device, or gallery, to show the problem. This could also be done using the sharing functionality, but the sharing would have to be added to other app/dashboard tiles/pages.",
        "Add a category into the phone app to track Asthma data such as peak flow, asthma symptoms, inhaler usage etc.   Moderator Edit: Clarified subject and updated label",
        "All the other clock faces can be displayed in the 24 hour format, but as soon as I switch to the retro clock face it displays in the 12 hour format, even though the 24 hour option is selected in settings... Could an update to fix this issue be implemented?",
        "I like to see sleep duration add versa 4 sleep schedule. Moderator edit: Clarified subject and updated label",
        "Tidal music app   Moderator edit: updated subject for clarity and label",
        "Please put a music app to fitbit, like spotify   Moderator Edit: Clarified subject and updated label",
        "I just had to update my Fitbit because the display got super glitchy.  I updated to the Inspire HR from the Alta HR.  I was very disappointed to see I can no longer have a \"sideways\" clock face on my device. I have grown used to this in the past few years wearing my Alta, and am unclear why this would no longer be supported.  Please update to include this option!   Moderator Edit: Clarified subject and updated label",
        "I use the Fitbit app to track my runs. It is recommended to start around 85% of my maximum heart rate, and stay at 90 until km 16 then go to 92/95%. I want to receive alerts when I pass one of these levels. Currently such alerts are in place for pre defined areas. I want to customize these areas. Thank you.   Moderator Edit: Clarified subject",
        "As someone who needs to track my mood I use Daylio because it lets me add data, notes, and other details to my entries. The current Stress Management Tracker does not give me the level of detail I need to track my moods. If the Fitbit could add the body metrics from their app that would be a plus",
        "Ability to track SpO2 levels   Moderator Edit: Clarified subject and updated label",
        "Add an option to manually add a swim workout (laps, distance, calories, etc). Currently, I can only track these by manually adding swim workouts on the desktop. I have an old charge 2 I need to keep using so I can’t swim with it. Moderator edit: Clarified subject and updated label",
        "Instead of only accepting the Agenda app on my Android smartphone as calendar data source on my smartphone, equally accept Outlook.com as calendar data source. As an outlook.com user the Agenda app is only an – unnecessary - step in between. Where mail is concerned, you already accept outlook.com as data sources, why not do the same for the calendar element ? Erik Verhulst",
        "The suggested recipes look yummy in the videos but lack ingredients and nutrition information. I’ve also seen apps with suggested recipes with a link to add to app calorie tracker. I signed up for premium specifically for the data tracking of calories in and feel this is lacking in the Fitbit product.   Moderator Edit: Clarified subject",
        "I was going through my data export and I found some issues. On the Fitbit app it clearly shows a break in heart rate recordings. Yet in the data I exported from google, it's as if I never took it off. This has happened on multiple days. It's as if they're making the data up. Again, the app properly shows when I take my watch off. What is going on?   Moderator Edit: Clarified subject and updated label",
        "Allow users to log when they get sick. Identify the illness. Then have them state what they were doing before they got sick..e.g they were traveling, big birthday bash, financial issues etc. cross reference w/ their health stats. I get sick all the time and I'd like to know if there are things I'm doing specifically to contribute to getting sic   Moderator Edit: Clarified subject and updated label",
        "Count the average number of extrasystoles AKA ventricular premature beats (VPBs) per day. You can use a fourier transform on the continuous heart rate monitoring to see if there's a second period of a skipping beat. Divide heart rate by second period to find the period (VPB-1, VPB-2, VPB-3) and estimate percentage of VPBs.",
        "An immediate notification when the user's HR goes over or under the set threshold (not just during inactivity after 10 minutes).   Moderator Edit: Clarified subject and updated label",
        "I bought the Sense for the ECG app. I'm based in the UK & travel a lot. Every time I travel to countries that aren't ECG app approved the device deletes the ECG app without any user prompt. This is a major flaw. Either allow third party ECG apps to develop or don't partially roll out ECG feature.   Moderator Edit: Clarified subject",
        "Allow for 3rd party apps, such as Starbucks app, on Sense 2!   Moderator Edit: Clarified subject and updated label",
        "Port the Relax App to ACE 2. Moderator edit: Clarified subject",
        "Add the tile function into the Luxe tracker, so that it can connect to the app   Moderator Edit: Clarified subject",
        "Chime is a rockin' online banking app run by Stride Bank in Oklahoma, but it is not currently serviced by FitPay. Adding them to your roster of serviceable institutions would be keen.   Moderator Edit: Clarified subject",
        "I'm from Iran and also 4 months ago I bought a fitbit versa 3. But after 21th march, generaly the clock in Iran moved 1 hour to front, but from this year, our goverment didn't move national clock because the law was chenge, but my clock's device moved 1 hour to front.   Moderator Edit: Clarified subject and updated label",
        "Hrv checks throughout the day. Moderator edit: Clarified subject",
        "Add a nausea option for menstrual tracking. Right now the closest option is sick but that implies illness and isn't accurate. Adding an option for no blood would also be a benefit as some birth control keeps bleeding from occurring even while menstruating.   Moderator Edit: Clarified subject",
        "When swimming the only live feedback you get is the duration in seconds. What you need is the number of lengths or distances in metres.   Moderator Edit: Clarified subject",
        "Please create an app for SiriusXM for the sense.    Moderator Edit: Clarified subject",
        "It is bit disappointing to buy a Charge 5, advertised with ECG app, and discover right away that the app is not yet available in Malaysia. Please roll it out asap.   Moderator Edit: Clarified subject",
        "Add Yardwork to Exercises and break it down with Pruning Mowing and Raking …. add active energy/ calories   Moderator Edit: Clarified subject",
        "Add rowing machine to apps   Moderator Edit: Clarified subject",
        "Please make horizontal screen view an option. The letters are too small on vertical for me to read, and I never had this issue with my Alta HR. Thanks.   Moderator Edit: Updated label",
        "Hello, I just moved from Android to IOS and discovered that the IOS app doesn't display the total step per week/month/year (only the average). It is a bit sad as it was data I was using with Android to motivate myself to be better than the past months and to compare with my friends..   Moderator Edit: Clarified subject",
        "Can you add a page that either on app or in on the charge4 let’s a user change the settings for the breath app. Four settings follow: 1 inhale duration 2 exhale duration 3 inhale vibrate reminder 4 exhale vibrate reminder   Moderator Edit: Clarified subject and updated label",
        "While searching for clock faces during Black History Month, Juneteenth, Black Lives Matter, etc there are no options. I'm not an artist myself, but collaborating with Black artists for clock faces would allow people to celebrate their heritage through their watch also.",
        "Other fitness watches/apps (Samsung gear sport was my last one that had this ability) have the ability to break down the miles run into pace and MPH speed for each mile and then an overall average. They also show the current MPH you are running. This is especially helpful when running outside or not on a treadmill.   Moderator Edit: Clarified subject",
        "I have had Fitbit’s for years. Was given a sense to replace my broken Verda 2. The alarm on the Sense is so weak! Can barely feel the vibration, very disappointing as can’t rely on this to wake me up. The Verda 2’s vibration was a lot better than this one.   Moderator Edit: Updated label",
        "After a period has been predicted, the user has to manually go into the app to confirm the period. If the predicted period is not confirmed, the algorithm changes the prediction. I suggest a push notification to remind users to confirm before this prediction is changed.",
        "I want to export EDA data and stress data   Moderator Edit: Clarified subject and updated label",
        "A way to track your cholesterol level   Moderator Edit: Clarified subject",
        "Simple play/pause & back/forward controls. This would work with whatever is currently playing on your pphone (ie it wouldn't be specific to Spotify/YouTube Music etc).   Moderator Edit: Clarified subject and updated label",
        "I like ecg on versa 4. Moderator edit: Clarified subject and updated label",
        "Hi guys! Do you think it is possible to have the hourly actitvity reminder 30mins before the hour ends? 10mins is too short especially for people like me who do desk work and there are times that get stuck in a middle of work and will completely forget the 10mins warning 🙂   Moderator edit: updated subject for clarity and label",
        "Allow the o2 data in the app not force me to use another clock face Moderator Edit: Clarified subject and updated label",
        "Please enable 2 way syncing between fitbit and my fitness pal for water intake.   Moderator Edit: Clarified subject and updated label",
        "Hi, Is it possible for the app to change the orientation when it is turned? Both horizontal and upside down?   Moderator Edit: Title and Labels",
        "The upgrade from the Versa 2 to the 4 has generally been pretty positive, but when I hit my step goal it doesn’t do fireworks or confetti anymore… just a boring notification with a shoe. It just feels anticlimactic and disappointing. Can we have something more celebratory?   Moderator Edit: Clarified subject and updated label",
        "Duo Mobile notification on Versa to accept or reject access     Moderator edit: Clarified subject and Labels",
        "Add shoeshowing and cross country skiing to Versa 3   Moderator Edit: Clarified subject and updated label",
        "If you take the ECG test on the Sense when your heart rate is over 100, the result will be \"inconclusive\". Competitors apparently give results up to 120 bpm. I realize a resting heart rate over 100 is Tachycardia and unlikely for most of your customers, but it's a cop-out to not give any result. Moderator edit: Clarified subject",
        "Please, please give us the ability to race against ourselves by letting us use a previous run over the same course. Tomtom currently have this feature and even show your previous performance as a ‘ghost’ runner on the watchface as you run.   Please!"
    ],
    "fitbit like subject edit moderator": [
        "Given that the community has been asking for this for 10 years, and now you will no longer have access to \"create a meal\" via the web version of the dashboard, it's making it harder for me to a fan and supporter of Fitbit, and I've been a fan for more than a decade. Please have the app have at least the same features as the web version (e.g., create a meal), but since it doesn't already exist, add the feature for # of servings to make our lives easier please! Moderator Edit: Clarified subject and updated label",
        "Fitbit sometimes does not capture all the the sleep info for the night. On the dashboard one could manually add the time and it would self correct. No longer possible. As others have commented, I missed the dashboard the the ability to view on a larger screen. Moderator Edit: Clarified subject",
        "I always look at my lifetime steps. At one time I thought of switching to another device. But I would have to start over with lifetime steps where I went. Moderator Edit: Clarified subject and updated label",
        "I can't always wear my Fitbit Inspire 2. and I calculated the miles/steps to add to the dashboard manually. The new app dashboard doesn't allow this and the Web dashboard was taken away from us. My steps and miles will be inaccurate on the days I cannot wear my Fitbit. I'm very disappointed and will likely go with a different brand for replacement.   Moderator Edit: Clarified subject",
        "The new design update is quite awful, in my opinion. The home screen can only be customized order by the entire group rather than individual items. This is so limiting. Please revert to allowing each item to be ordered independently. Moderator Edit: Clarified subject",
        "Chatting with support, someone told me eventually all users will be \"forced\" to link their FitBit with google account. If there is an issue with the account this means you have to change the whole google account (ie password) to accomodate FitBit, which is what happened to my account Moderator Edit: Clarified subject and updated label",
        "Hello, I had bought this watch from Australia and now that I have moved to a region that is not supported (Fiji) . It is sad to see that I had opted for the Google pixel watch 3 for its features rather than the competition and it doesn't even have all of it enabled. Please enable it here, the rest of the smart watches already has it enabled here   Moderator Edit: Clarified subject and updated label",
        "Fitbit can sync with Google Health Connect, but it's missing key information. Please add sync to read weight, nutrition, and glucose from Health Connect. Moderator edit: Updated label",
        "Please make it possible to show the current date and day on the Fitbit Ace LTE home screen   Moderator Edit: Clarified subject and updated label",
        "With the upgrade the app will no longer work unless Background Location Permission is allowed all the time, whether the app is in use or not. What possible justification do you have for that? Now Fitbit feels like spyware. Is this so Google can create location based advertising or what? Moderator edit: Clarified subject",
        "Can there please be a Fitbit Ace app developed for Wear OS so that parents can message a child's Fitbit Ace LTE watch from their Wear OS/Pixel Watch, and not use a smartphone.   Moderator Edit: Clarified subject and updated label",
        "Fitbit Premium should be reserved for complementary products and services, not data access/analysis. Fitbit has chosen to put the data that differentiates the hardware behind a paywall, leaving the hardware undifferentiated. This is a doomed (and lazy) strategy.",
        "Some super basic features missing. How can a watch be released without them, seriously, 1. Phone music control via the watch 2. Google Calendar integration - (You read it right, google calendar not even working...) 3. Google Map integration, it shows on your marketing site, but it is not working, Seriously????   Moderator Edit: Clarified subject",
        "As a software engineer I find it excruciatingly painful that some settings are done on the watch and some on the Android or iOS app. Move everything to the app and include those settings as part of the sync process.   Make Fitbit devices settings available on Fitbit app",
        "Dear team, Allow the import / automatically import Trainings from other platforms and take them into account when calculating the training load. There are several platform where trainings are recorded. It is a pain to double record them on several devices. (This even can be a premium feature I would pay for.) Moderator edit: Clarified subject",
        "I understand why guided coaching and meditation videos are extra and should be paid for but we shouldn’t have to pay extra for data gathered by Fitbit devices. Other brands of fitness trackers and watches show similar data to the “Fitbit Daily Readiness Score” and other analytics free of charge. I like Fitbit devices but this is unfair.",
        "Perimenopause is not reflected in the menstrual health section. There are no options to add HRT or to log symptoms like brain fog, difficulty sleeping, or night sweats, Moderator edit: Clarified subject",
        "Google has released the new \"Find my Device\" dashboard, but Fitbit Charge devices are not supported. Now, if even a Bluetooth speaker like JBL Flip 6 can make it, I believe time has come for Fitbit devices (starting with Charge 5 and 6) to be tracked for safety / retrieval purposes. Moderator edit: Clarified subject",
        "The current Tiered Support model makes it impossible for users to get meaningful status updates on a case once it has progressed beyond the front-line support team. This means that anything complex, like a faulty device that needs to be returned, disappears into a black hole that the customer has no control over. Moderator Edit: Clarified subject",
        "Not sure if this is a bug but I just noticed that my contacts see the option to call or message my kids during school time. Moderator edit: Clarified subject",
        "Due to losing my Fitbit Versa 3 Smartwatch, I bought a replacement Versa 4 device. I was not aware on purchasing the new device that the Detect Snoring is not available. Only found out by contacting support. Moderator Edit: Clarified subject.",
        "I do curling and it would be nice to have the option to record that workout. I know the Apple devices have that for an option but not fitbit. I hate apple products and have been using fitbit devices for years. Please add this in already! Moderator edit: Clarified subject and updated label",
        "I used to be able to delete individual entries in the Sleep Log, now identified as OTHER. The app allows for the OTHER items to be edited for time entries, but not to be deleted. In my case, some OTHER entries are correct, others are wrong (I am working at my desk or watching TV are recorded as Sleep entries under Other).   Moderator Edit: Clarified subject and updated label",
        "I have been a loyal customer to Fitbit and am disappointed that took Pandora off the Versa 2. That was the main selling point for me. I don't know if I will remain with Fitbit when I need a new watch.   Moderator Edit: Clarified subject",
        "Let me know the progress of the hourly goal. Waiting for the 10 minutes until the hour and rushing around is not idea. I am used to a blaze, but switched to a Pixel and it has less features.",
        "Can we have the Charge 6 play music while the phone is at home? Makes no sense now to even have the premium account because we can just listen to our music straight from our phones. And it's pointless now to even have the Built-in GPS because we still need our phone in our possession so we can listen to our songs when running.",
        "The Stress Management Full Breakdown function is currently locked. This is highly unfair to customers who have paid for the top of the line very expensive watch. I can get similar breakdowns in my Apple Watch by buying a $5 app. I understand that Premium is necessary for training videos. meditations and coaching.",
        "I have a Pixel Watch 2 with LTE and I subscribe to Fitbit Premium. When I run, I usually don't take my phone. I connect my Pixel Buds to the watch and listen to music as I run. Recently, I have wanted to start using the coaching modules to increase my running speed. Is it possible to use these coaching sessions as audio only options on my watch?",
        "I have the premium membership and would like to stream the workout videos on a larger screen like my laptop or my tv. I don't see that as an option and fitbit support told me to make the suggestion here.   Moderator Edit: Clarified subject",
        "Some of us just care about logging in our steps & sleep; we don't need Bluetooth turned on the entire time. Especially while we're sleeping: why doesn't Bluetooth automatically turn off while we're sleeping? If this is impossible to do via a firmware update, can you please release a tracker solely dedicated to the health metrics & nothing more?",
        "Am I unlucky ... or is this your business model? August 2016: purchase Fitbit Alta August 2017: warranty expires on Alta June 2019: Alta dies June 2019: purchase Charge 3 June 2020: warranty expires on Charge 3 January 2022: Charge 3 dies January 2022: purchase Charge 5 January 2023: warranty expires on Charge 5 July 2024: Charge 5 dies Moderator Edit: Clarified subject",
        "Research indicates (refer to links below) that it is possible to detect potential Heart Attack based on Heart Rate and Heart Rate zones. Fitbit watches constantly monitor heart rate and theoretically it should be possible to detect potential heart attack based on abnormal heart rate and resting heart rate's trend.   Emergency SOS: Fitbit device should trigger alert on paired mobile phone which sends out a SOS message along with geo-location to pre-configured address to ensure timely medical assistance. Preventive Alert: Fitbit should alert the user if it sense potential Heart Attack based on current & resting heart rate patterns or change to a different heart rate zone. Reference: Warning Signs of Heart Failure Resting Heart Rate in Cardiovascular Disease   Moderator Edit: Added Labels",
        "Could you ask the developer to add the steps to always on display in addition to time and date. It is annoying to have tap the screen to view steps whilst out running.   Moderator Edit: Clarified subject",
        "Please double check the HRV measurements: For many users the rates of HRV are very low and somehow scary. Please check this thread https://community.fitbit.com/t5/Charge-4/Does-the-Charge-4-calculate-HRV-accurately/td-p/4498519   Moderator Edit: Clarified subject and updated label",
        "Hi Fitbit, Could you add the option to change the colour or theme of the Steps, Floors, Sleep, Hourly activity and all others under the Today Section of the Fitbit app and also have the option to change the colour or theme of other parts of the Fitbit app too.   Moderator Edit: Clarified subject and updated label",
        "I recommend that you keep the 'battery' indicator display On while the unit is charging. Sometimes contacts get dirty and users are unaware that their fitbit is connected to the charge port but not charging because the display quickly shuts down after connection. If it's kept running during charging, can actively monitor progress.",
        "Fitbit features: gentler exercises, delete menstruation, fall alerts, medication tracking, adjustment for age in heart expectations.   Moderator Edit: Clarified subject",
        "The choice of watch faces for charge 6 is very small . Please Integration at least something simple in black and white that doesn't look like I am stuck in the seventies. Even on charge 4 I had better options. Moderator edit: Clarified subject",
        "I have a 13-year old with a supervised family link managed account. The Fitbit Charge 6 is designed for ages 13 and up, but will not work on managed accounts as a matter of Google/Fitbit policy, not a technical limitation of the device.   Moderator Edit: Clarified subject and updated label",
        "The Charge 3 and Charge 4 had several different animations for step goal completion. I'm especially font of the shiny disco balls animation. On the Charge 5 I only see one and it's really boring. Please bring more stepgoal animations to the Charge 5 Moderator edit: Clarified subject",
        "Other smartwatches/Trackers have the app option of Voice Recorder. I'm trialing a FitBit Sense & would like this feature.",
        "For the Inspire 2, please add an option in settings to increase the amount of time my screen stays lit. I don't care whether it's adjusted on the watch, in my phone app, or online; I just want a way to change that setting.   Moderator Edit: Clarified subject",
        "Often my Fitbit misunderstands if I am trying to sleep or not when I am in bed relaxing or when I am awake but just slow to get out of bed, which artificially lowers my sleep score. Currently, there is no way to remedy this on the Fitbit app, and it’s an issue that is common to all models of Fitbits..",
        "It's 2018. Simply put, new devices and applications which don't take into account the needs of the world community in terms of a very basic date display should not exist. It's not that hard.   I can understand that the majority of folks in the USA don't really care about the way the rest of the world uses dates. And it would therefore be exceedingly difficult to drum up enough support via a \"popular vote\". But, it's just common courtesy.   Moderator Edit: Clarified subject and updated label",
        "I would like to see more time labels along the bottom (X-axis) of the Estimated Oxygen variation chart. Currently there are only two time labels, at the start and at the end. These are not sufficient and make it difficult to work out the times between in relation to the chart line.    Moderator edit: Subject for clarity",
        "I often log my activity long after the activity itself. When I enter the start time, the app defaults the duration to the number of hours passed since that start time. This means my standard 1 hour yoga class defaults to, for example, 6hrs 42m. This is nonsensical. Moderator Edit: Clarified subject",
        "Want find my phone app to work from Fitbit watch even if Fitbit app isn’t open on my phone.   Moderator Edit: Clarified subject and label.",
        "Let the Pixel watch use the bedtime mode on my phone to start bedtime mode automatically on the watch. It's ridiculous to have to start bedtime mode.",
        "The monthly sleep profile takes up almost half the screen on the mobile app. I must swipe up (every day) just to get to my sleep details for last night. If the profile changes each month, why do I need to see this every day?",
        "Add the ability for parents to open the Fitbit Ace LTE app and view battery level, health related stats, LTE signal level, last location and time/date of last Fitbit check-in time to tell if the data is old. Moderator Edit: Clarified subject",
        "I would like my Google Pixel Watch to alert me (vibrate) every mile I complete during my runs.   Moderator Edit: Clarified subject and label",
        "Can you please remove the multi tap feature for the dismissal of the alarms? I use my alarms for more than just waking up. I use them to help me keep my morning moving & sometimes when my alarm goes off while I'm driving, it's dangerous for me to have to look at the tracker to dismiss. 99% of the time I have to snooze until I get to my destination",
        "There is a difference between being “restless” and being “awake”.It used to show the difference. Now it is all called “awake”! That I s not accurate and gives a false impression of your sleep. It will show you were “awake” for an hour of your bedtime when you were actually awake 17 minutes!   you need to put that back into your program!   Moderator edit: Subject for clarity and labels.",
        "Ask the software developers before releasing to the Fitbit users to review all screens in the Fitbit applications and on the Fitbit website for used ability by those who are blind and reading disabled. Ask them to use screen reading software as part of the screen valueation specifically the number of swipes necessary to advance through the screens.",
        "I'm looking to replace my aging Charge 2 (cracked screen from rock climbing), & it seems the Charge 4 now has internal GPS with very limited 5 hour battery life, useless even for day hikes. And, the Inspire has no altimeter. Does Fitbit make a tracker for hiking, with in-app realtime track maps, that also include elevation & heart rate?",
        "Provided my watch is within Bluetooth range, I would like the ability to send a vibrating alert to the watch so that I can attempt to find it. The vibration alone is often enough to provide a clue on location. BONUS: Add the ability to detect signal strength.   Moderator Edit: Clarified subject and updated label",
        "I would like to see an option to include disabilities including invisible illness’ on the app. Could have advise and suggestions from known charities etc that support those with the conditions. But I would like the app to adjust the goals with the conditions in mind. Maybe other ways to help manage the condition like reminders of physio exercises?",
        "Please add Turkish language support our devices and application.   Moderator Edit: Clarified subject",
        "Previously, the recent foods list sorted foods according to log order. That changed in a recent update and now the foods appear to be in random order. This is unusable. Please revert to the original sorting order.   Moderator Edit: Clarified subject",
        "In the beginning of the week I would like to get suggestions about what the goal should be for this week based on how I performed last week. For example if my goal is 10 000 steps and my average is 12 000, suggest that it should be increased and vice versa. This could maybe be a section in the weekly summary email or a notification.",
        "Let long-term customers also qualify for the sale bundles for products and services as new customers.   Moderator Edit: Clarified subject",
        "When running, I like to have audio cues for time and distance so I don't have to check my watch/phone often to know when I need to turn around. I like to have a cue every 5min and every mile. When the audio cues trigger, I like it to report my current time, current distance, and current pace.   Moderator Edit: Clarified subject and updated label",
        "The Charge 6 charging screen doesn't observe regional settings - it displays the date in US date format - mm/dd rather than observing regional settings (eg. dd/mm or dd.mm) Moderator edit: Clarified subject and updated label",
        "I appreciate that I can customize the order and show/hide different metrics of Fitbit Today on my phone app, but it doesn't look like those preferences are synced to how the Fitbit Today information is displayed on my Pixel Watch. I would like these to be the same so I'm only seeing the information I want to see and in the order of importance to me Moderator Edit: Clarified subject",
        "My idea is that the fitbits should be kinetic. Fitbit is all about being active, if you have to take your Fitbit off all the time to charge your activity tracker will be stop start. If the Fitbit charged with your movement and activness you would never have to take it off. With the technology that is in watches now this is defiantly possible.    Moderator Edit: Clarified subject and updated label",
        "Fitbit party doesn’t support any of the Indian banks even the major ones. Fitbit has lots of customer base here so this must be provided.   Moderator Edit: Clarified subject",
        "Please remove the annoying, repetitive question when I turn on my Fitbit::Allow Location Access. I am not interested in this feature and feel I am being treated as a child who doesn’t know what is good for them! Show me some RESPECT please, Fitbit. I have disabled location in my iPhone and in the Fitbit app and yet the question repeats, repeats, re   Moderator Edit: Clarified subject",
        "This would work just like auto recognized exercises. Enter the minimum amount of sleep required to trigger sleep logging.   Moderator Edit: Clarified subject",
        "I would like to log a glass of water just by tapping on the device, without having to do it from my mobile app. Saving time and improving user experience. A glass of water appears by default and to log bigger items like bottles just scrolling down would be enough to reveal them. I have the Inspire 2 and my wife has the new Luxe.   Moderator Edit: Clarified subject",
        "a small thin ring that has 4 magnetic prongs to connect to charging ports on the back of the Fitbit sense while it is not charging.",
        "\"sleep mode\" and \"do not lock\" mode have been locking each other (I have translated the two functions, I don't know how they are displayed on the watch in English). I can't take out the sleep mode because I have to deactivate the non-lock mode first. However, I can only activate this if I deactivate sleep mode. It's a vicious circle.",
        "Why does Fitbit count stept when I started a cycling activity? please implement If (activity == cycling) { count_steps = false }   Moderator Edit: Clarified subject",
        "As per other graphs like Sleeping HR and Sleep Stages, please add the expand button to make the graphs larger and easier to read.",
        "Make the street management analysis flexible with regards to sleep schedule. Do not lock the times when someone must sleep in order to receive a stress Management score. That, or adjust the system so we can set our daily schedule times to a different time zone without setting the watchface to said timezone. Moderator edit: Clarified subject",
        "I use fitbit to track on a google map my bike rides. The recent fitbit application update deleted the speed chart. This was a very helpful key feature for me. The device I use now only has an average speed based on split segments. It is not useful to me. Please bring back the speed chart and the maximum speed recorded.   Moderator Edit: Clarified subject",
        "My Sense 2 often does not log all of my sleep automatically. First, if I edit the sleep, usually the app loses all of the sleep stage information. Second, because of First, I will usually log additional sleep. I leave a minute between the segments. But then the automatically recorded sleep displays strangely, being shifted over like 1/4.",
        "Some of us still want something very small that we can wear all the time and only charge every five days for so. I don't need another screen.  I had the FitBit Flex 2 and never took it off.  Same with my husband. We need the step tracking for our health insurance and so I don't want to have to take something off and charge all the time. Plus is lasts longer and is just no fuss.  I can EASILY layer with jewelry and I just need something simple.   Moderator Edit: Clarified subject",
        "When I manually log an activity that my device recorded but the app does not reflect, I can add distance and time but not active zone minutes. For example, a walk that Fitbit automatically logged was 102 zone minutes. The walk that I needed to manually log had been over 350 zone minutes, but I was not able to add those. Total s/b 452, not 102. Moderator Edit: Clarified subject and updated label",
        "Improve the quality of Fitbit devices so that they don't stop working as soon as the warranty expires Moderator edit: Clarified subject and updated label",
        "Provide the ability to SHUT DOWN Charge 5 when not in use.",
        "New Watch, new customer. It took me DAYS and talking to chat support to figure out how to strop the \"Reminder to Move\" notification. I even stopped all notifications on the phone side and they still come in. SOOO **ahem** infuriating. You should fire the product manager immediately or whoever came up with the idea to BURY that setting in the app. Moderator Edit: Clarified subject",
        "The plastic attachment point snapped off of my charge 4, leaving my fitbit essentially useless. A pin style attachment point is easily reparable (assuming the arms don't snap off like my charge 4) I've ordered a new Charge 6.   Moderator Edit: Clarified subject",
        "When Opening the today section of your watch in the morning, you could always check how you slept, regardless of if you are close to your phone or sync with your phone Moderator edit: Clarified subject",
        "Suppose the recommended lifespan of a fitbit is 2 years (or 18 months or 3 years) This may be because you hope people will upgrade to a new improved model Include premium for those 2 years Then you provide an inducement for upgrading, without annoying your customers by putting features behind a paywall Moderator edit: Clarified subject",
        "FitBit's sleep profiles (and probably other stats) need to be based on user age. Moderator edit: Clarified subject",
        "When switching to a Google Login, it has been reported that Friends are no longer friends. Can we have our friends linked to the new account? Moderator edit: Clarified subject and updated label",
        "I would like an option to disable the Relax function on my Fitbit.   Moderator Edit: Clarified subject",
        "I've recently been stuck in a slump losing weight again, and really struggling to get back on track to at least maintaining my weight again. I got a pixel watch 2 with my new phone plan and am attempting to use the Fitbit app to help visualize the cal.-deficit and reach a stable point, but the \"Over-Budget Red\" graph color is a negative incentive.",
        "add the new Google Pixel Watch to the device list on the website   Moderator Edit: Clarified subject and label",
        "As Fitbit Pay becomes discontinued this July, please ensure existing cardholders can still use their cards including stored value and passes. Also, for new users with Fitbit Pay compatible Google Wallet devices, please ensure they can still use iPASS and Suica despite device purchased outside Japan. Moderator edit: Clarified subject",
        "At the moment it's almost impossible to correctly track stepsPerHour in a clock face. It is not exposed via the activity API, and tracking it manually is very buggy since Clockfaces do not update when the display is off -- as a result, correctly syncing the current steps value on the hour, every hour is not really possible.   Here's a thread from 2018 where a Fitbit developer agrees there's no way to do this: https://community.fitbit.com/t5/SDK-Development/Steps-this-Hour-on-a-Watch-Face/m-p/2942003/highlight/true#M6090. There's many other similar threads of hacks people have tried to do to display this, but it's been 2 years and no updates have been made to the API to fix this.   🙏 🙏 🙏",
        "There should be a page with discontinued items so it's easier to know if I/users need to purchase a different model/watch, instead of thinking it won't charge anymore or the updates failed.   Moderator Edit: Clarified subject",
        "Once a tracker is passed the 1 year warranty, there is no technical support or way to fix the devices. The support team goes through the troubleshooting list, but if nothing works and you are passed the warranty, all that is offered is a discount to buy another product hoping that the same issue doesn’t occur. What about the defective device? Shouldn’t there be a place to get it repaired?   Moderator edit: updated subject for clarity and label",
        "Fitbit should allow multiple devices, even of the same type, to be added to one's fitbit account. For example multiple pixel watches. I'm being forced to select the label for this post, but none of them quite meet the needs of what I'm trying to say.   Moderator Edit: Clarified subject and label.",
        "I would like horse riding to be trackable by GPS same as running or walking.   Moderator Edit: Clarified subject",
        "There should be a Fitbit Premium option made to where you can just purchase the options you would like! I would only really use the premium for sleep and heart rate. I'd hate to spend money on something I will not use.    Moderator edit: updated subject for clarity",
        "hi, I got the sp02 graphs. but I would like numbers on it  or score of the blood level? Oxygen also to have the graph on the watch in self? so you could see the graph on the watch. and have the graph  on online dashboard too. hope this helps.   from Oliver    Moderator Edit: Clarified subject and updated label",
        "It would be extremely helpful if we could view a comparison of our sleep stages over time (weekly/monthly/etc), instead of the current option of just overall sleep duration. It's actually disappointing that this isn't available at all since the collected data is already there but we can't view it in a comparison mode like overall sleep duration.",
        "Hello, so while I'm sleeping it counts the steps (movements) I make while I'm sleeping. This will give me a wrong result at the and of the day. I'm not talking about 50 steps but 320 steps or even more. Would it be possible to set a timer that my Charge 3 won't count the steps between a time I can set. As a example between 23:00 - 07:00 no step counting.   Greetings Ralph   Moderator Edit: Clarified subject and updated label",
        "I would like to have a feature that would allow me to tap my Fitbit device and that would make someone else’s device vibrate. It can be one specific person or a group of people who also opt in this service.   Moderator Edit: Clarified subject",
        "would like to know if its possible to tailor the breath rate in the relax app? the default is way too fast for me. I'm almsot hyperventilating so far i've resolved to using the timer and breathing how i'd like to but annoyingly this doesn't register in our mindfulness stats or whatever.   ideally i'd like guided breathes for  5 secs inhale, 5 secs exhale and 4 sec inhale, 6 sec hold, 7 sec exhale   Moderator Edit: Clarified subject and label.   which i use for getting to sleep   Please let me know if i'm missing something? or maybe if we make enough noise about it, if this post gets enough notice, Fitbit might revise the breathwork feature",
        "I just bought a Charge 6. When I went to add it to the app, you are requiring me to set up a Google account. I have been avoiding using google for anything if I don't have to, and this makes me very unhappy. I am stuck now since I just bought the watch, but my next watch will not be a Fitbit because I do not want to use Google. I will no longer Fit",
        "Why don't you provide comparative averages for my age and gender; overall and by country? What a missed opportunity. Garmin does it.   Moderator Edit: Clarified subject",
        "Just got my Charge 3 yesterday. Things I'm noticing that I'd like to see chage in.   (1) The time the unit displays on wake-up (moving the wrist) is a bit short. Would prefer display stays on a second or two longer. Or, please give us a setting we can adjust.  (2) For exercise types, I would like to see \"Stretching\" as an option to track time for.      Moderator edit: Clarified subject and label",
        "E.g. I fell from the stairs and broke a leg. My phone is out of reach but still within Bluetooth reach. Through my watch I could send a message to request help, simply by replying to a stored message. Currently, if all messages are cleared (which is usually the case) we can’t reach anyone. Moderator edit: Clarified subject and updated label",
        "Please can the app simultaneously sync and give notification about multiple devices. Eg I have one adult and two children's devices linked on my fitbit app on my phone, but it only gives notifications about whichever profile it's logged into at the time, therefore the other 2 are totally silent unless I'm constantly switching profiles to check!   Moderator Edit: Clarified subject",
        "We need a program to record water aerobics.  Presently we must tailor another exercise program, but there is no tracker for calories burned, step adjustment, etc. Tailoring “Walk” gives a step counter and time, but no way to adjust stride. SOLUTION: step length, step counter, then 4-5 resistance or intensity levels, length of time at each level, or average intensity. Incorporate arm activity in intensity.    Presently I have no reason to upgrade to Versa.  Perhaps this could be a separate waterproof device that syncs to dashboard.     Moderator edit: Updated subject for clarity.",
        "I'm getting notifications that there is a new firmware for the Charge 3. I don't want it but the 'Upgrade' notification is constantly appearing in the app. Please make it so that this can be disabled. The firmware update seems to be causing problems for lots of users. The Fitbit is working and I don't want the hassle of it being bricked."
    ]
}